<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/0727bf85-a7ed-4e2c-aea3-05aa2c5e5b38/terraform-bin -chdir=terraform show -no-color /tmp/plan.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.analytics.aws_kms_alias.analytics_bucket will be created
  + resource "aws_kms_alias" "analytics_bucket" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/analytics/cast/prod"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.analytics.aws_kms_key.analytics_bucket will be created
  + resource "aws_kms_key" "analytics_bucket" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 10
      + description                        = "cast.prod - analytics bucket encryption"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags_all                           = {
          + "Name"      = "walletconnect-prod-cast"
          + "Namespace" = "walletconnect"
          + "Stage"     = "prod"
        }
    }

  # module.analytics.aws_s3_bucket.analytics-data-lake_bucket will be created
  + resource "aws_s3_bucket" "analytics-data-lake_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "walletconnect.cast.prod.analytics.data-lake"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "Name"      = "walletconnect-prod-cast"
          + "Namespace" = "walletconnect"
          + "Stage"     = "prod"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.analytics.aws_s3_bucket_acl.analytics-data-lake_acl will be created
  + resource "aws_s3_bucket_acl" "analytics-data-lake_acl" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)
    }

  # module.analytics.aws_s3_bucket_public_access_block.analytics-data-lake_bucket will be created
  + resource "aws_s3_bucket_public_access_block" "analytics-data-lake_bucket" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.analytics.aws_s3_bucket_server_side_encryption_configuration.analytics-data-lake_bucket will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "analytics-data-lake_bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + bucket_key_enabled = true

          + apply_server_side_encryption_by_default {
              + kms_master_key_id = (known after apply)
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # module.analytics.aws_s3_bucket_versioning.analytics-data-lake_bucket will be created
  + resource "aws_s3_bucket_versioning" "analytics-data-lake_bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.ecs.aws_ecs_service.app_service will be updated in-place
  ~ resource "aws_ecs_service" "app_service" {
        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/prod-cast/prod-cast-service"
        name                               = "prod-cast-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/prod-cast:16" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.app_task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "app_task_definition" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/prod-cast:16" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "prod-cast" -> (known after apply)
      ~ revision                 = 16 -> (known after apply)
      - tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_iam_policy.analytics-data-lake_bucket_access will be created
  + resource "aws_iam_policy" "analytics-data-lake_bucket_access" {
      + arn         = (known after apply)
      + description = "Allows prod-cast to read/write from walletconnect.cast.prod.analytics.data-lake"
      + id          = (known after apply)
      + name        = "prod-cast_analytics-data-lake_bucket_access"
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Name"      = "walletconnect-prod-cast"
          + "Namespace" = "walletconnect"
          + "Stage"     = "prod"
        }
    }

  # module.ecs.aws_iam_policy.geoip_bucket_access will be created
  + resource "aws_iam_policy" "geoip_bucket_access" {
      + arn         = (known after apply)
      + description = "Allows prod-cast to read from prod.relay.geo.ip.database.private.prod.walletconnect"
      + id          = (known after apply)
      + name        = "prod-cast_geoip_bucket_access"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::prod.relay.geo.ip.database.private.prod.walletconnect",
                        ]
                      + Sid      = "ListObjectsInGeoipBucket"
                    },
                  + {
                      + Action   = [
                          + "s3:CopyObject",
                          + "s3:GetObject",
                          + "s3:HeadObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::prod.relay.geo.ip.database.private.prod.walletconnect/*",
                        ]
                      + Sid      = "AllObjectActionsInGeoipBucket"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Name"      = "walletconnect-prod-cast"
          + "Namespace" = "walletconnect"
          + "Stage"     = "prod"
        }
    }

  # module.ecs.aws_iam_role_policy_attachment.analytics-data-lake-bucket-policy-attach will be created
  + resource "aws_iam_role_policy_attachment" "analytics-data-lake-bucket-policy-attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "prod-cast-ecs-task-execution-role"
    }

  # module.ecs.aws_iam_role_policy_attachment.geoip-bucket-policy-attach will be created
  + resource "aws_iam_role_policy_attachment" "geoip-bucket-policy-attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "prod-cast-ecs-task-execution-role"
    }

  # module.o11y.grafana_dashboard.at_a_glance will be updated in-place
  ~ resource "grafana_dashboard" "at_a_glance" {
      ~ config_json  = jsonencode(
          ~ {
              ~ panels               = [
                    # (7 unchanged elements hidden)
                    {
                        datasource  = {
                            type = "prometheus"
                            uid  = "x-XVJF14k"
                        }
                        fieldConfig = {
                            defaults  = {
                                color      = {
                                    mode = "palette-classic"
                                }
                                custom     = {
                                    axisLabel         = ""
                                    axisPlacement     = "auto"
                                    barAlignment      = 0
                                    drawStyle         = "line"
                                    fillOpacity       = 0
                                    gradientMode      = "none"
                                    hideFrom          = {
                                        legend  = false
                                        tooltip = false
                                        viz     = false
                                    }
                                    lineInterpolation = "linear"
                                    lineStyle         = {
                                        fill = "solid"
                                    }
                                    lineWidth         = 1
                                    pointSize         = 5
                                    scaleDistribution = {
                                        type = "linear"
                                    }
                                    showPoints        = "auto"
                                    spanNulls         = false
                                    stacking          = {
                                        group = "A"
                                        mode  = "none"
                                    }
                                    thresholdsStyle   = {
                                        mode = "off"
                                    }
                                }
                                mappings   = []
                                thresholds = {
                                    mode  = "absolute"
                                    steps = [
                                        {
                                            color = "green"
                                            value = null
                                        },
                                        {
                                            color = "red"
                                            value = 80
                                        },
                                    ]
                                }
                            }
                            overrides = []
                        }
                        gridPos     = {
                            h = 8
                            w = 12
                            x = 12
                            y = 18
                        }
                        options     = {
                            legend  = {
                                calcs       = []
                                displayMode = "list"
                                placement   = "bottom"
                            }
                            tooltip = {
                                mode = "single"
                                sort = "none"
                            }
                        }
                        targets     = [
                            {
                                datasource   = {
                                    type = "prometheus"
                                    uid  = "x-XVJF14k"
                                }
                                exemplar     = true
                                expr         = "increase(dispatched_notifications{type=\"sent\"}[5m])"
                                interval     = ""
                                legendFormat = "Sent push"
                                refId        = "A"
                            },
                        ]
                        title       = "Dispatched Notifications"
                        type        = "timeseries"
                    },
                  ~ {
                      ~ alert       = {
                          ~ name                = "Cast failing on send (communicating with relay)" -> "prod Cast failing on send (communicating with relay)"
                            # (9 unchanged attributes hidden)
                        }
                        # (8 unchanged attributes hidden)
                    },
                    {
                        datasource  = {
                            type = "prometheus"
                            uid  = "x-XVJF14k"
                        }
                        fieldConfig = {
                            defaults  = {
                                color      = {
                                    fixedColor = "light-yellow"
                                    mode       = "fixed"
                                }
                                custom     = {
                                    axisLabel         = ""
                                    axisPlacement     = "auto"
                                    barAlignment      = 0
                                    drawStyle         = "line"
                                    fillOpacity       = 0
                                    gradientMode      = "none"
                                    hideFrom          = {
                                        legend  = false
                                        tooltip = false
                                        viz     = false
                                    }
                                    lineInterpolation = "linear"
                                    lineStyle         = {
                                        fill = "solid"
                                    }
                                    lineWidth         = 1
                                    pointSize         = 5
                                    scaleDistribution = {
                                        type = "linear"
                                    }
                                    showPoints        = "auto"
                                    spanNulls         = false
                                    stacking          = {
                                        group = "A"
                                        mode  = "none"
                                    }
                                    thresholdsStyle   = {
                                        mode = "off"
                                    }
                                }
                                mappings   = []
                                thresholds = {
                                    mode  = "absolute"
                                    steps = [
                                        {
                                            color = "green"
                                            value = null
                                        },
                                        {
                                            color = "red"
                                            value = 80
                                        },
                                    ]
                                }
                            }
                            overrides = []
                        }
                        gridPos     = {
                            h = 8
                            w = 12
                            x = 12
                            y = 26
                        }
                        options     = {
                            legend  = {
                                calcs       = []
                                displayMode = "list"
                                placement   = "bottom"
                            }
                            tooltip = {
                                mode = "single"
                                sort = "none"
                            }
                        }
                        targets     = [
                            {
                                datasource   = {
                                    type = "prometheus"
                                    uid  = "x-XVJF14k"
                                }
                                exemplar     = true
                                expr         = "increase(dispatched_notifications{type=\"not_found\"}[5m])"
                                interval     = ""
                                legendFormat = "Not found"
                                refId        = "A"
                            },
                        ]
                        title       = "Not found accounts"
                        type        = "timeseries"
                    },
                    {
                        collapsed = false
                        gridPos   = {
                            h = 1
                            w = 24
                            x = 0
                            y = 34
                        }
                        panels    = []
                        title     = "AWS Load Balancer"
                        type      = "row"
                    },
                  ~ {
                      ~ alert       = {
                          ~ name                = "Cast Server 4XX alert" -> "prod Cast Server 4XX alert"
                            # (9 unchanged attributes hidden)
                        }
                        # (8 unchanged attributes hidden)
                    },
                  ~ {
                      ~ alert       = {
                          ~ name                = "Cast Server 5XX alert" -> "prod Cast Server 5XX alert"
                            # (9 unchanged attributes hidden)
                        }
                        # (8 unchanged attributes hidden)
                    },
                    {
                        datasource  = {
                            type = "cloudwatch"
                            uid  = "BvXV1F1Vz"
                        }
                        fieldConfig = {
                            defaults  = {
                                color      = {
                                    mode = "palette-classic"
                                }
                                custom     = {
                                    axisLabel         = ""
                                    axisPlacement     = "auto"
                                    barAlignment      = 0
                                    drawStyle         = "line"
                                    fillOpacity       = 0
                                    gradientMode      = "none"
                                    hideFrom          = {
                                        legend  = false
                                        tooltip = false
                                        viz     = false
                                    }
                                    lineInterpolation = "linear"
                                    lineWidth         = 1
                                    pointSize         = 5
                                    scaleDistribution = {
                                        type = "linear"
                                    }
                                    showPoints        = "auto"
                                    spanNulls         = false
                                    stacking          = {
                                        group = "A"
                                        mode  = "none"
                                    }
                                    thresholdsStyle   = {
                                        mode = "off"
                                    }
                                }
                                mappings   = []
                                thresholds = {
                                    mode  = "absolute"
                                    steps = [
                                        {
                                            color = "green"
                                            value = null
                                        },
                                        {
                                            color = "red"
                                            value = 80
                                        },
                                    ]
                                }
                            }
                            overrides = []
                        }
                        gridPos     = {
                            h = 10
                            w = 7
                            x = 14
                            y = 35
                        }
                        options     = {
                            legend  = {
                                calcs       = []
                                displayMode = "list"
                                placement   = "bottom"
                            }
                            tooltip = {
                                mode = "single"
                                sort = "none"
                            }
                        }
                        targets     = [
                            {
                                alias            = ""
                                datasource       = {
                                    type = "cloudwatch"
                                    uid  = "BvXV1F1Vz"
                                }
                                dimensions       = {
                                    LoadBalancer = "app/prod-cast-load-balancer/1d8bba8db8109fec"
                                }
                                expression       = ""
                                id               = ""
                                matchExact       = true
                                metricEditorMode = 0
                                metricName       = "RequestCount"
                                metricQueryType  = 0
                                namespace        = "AWS/ApplicationELB"
                                period           = ""
                                queryMode        = "Metrics"
                                refId            = "A"
                                region           = "default"
                                sqlExpression    = ""
                                statistic        = "Sum"
                            },
                        ]
                        title       = "Request"
                        type        = "timeseries"
                    },
                ]
                tags                 = []
                # (16 unchanged attributes hidden)
            }
        )
        id           = "0:prod-cast"
        # (7 unchanged attributes hidden)
    }

  # module.o11y.grafana_data_source.cloudwatch will be updated in-place
  ~ resource "grafana_data_source" "cloudwatch" {
        id                 = "104"
      ~ json_data_encoded  = jsonencode(
          ~ {
              - authType      = "ec2_iam_role"
              - manageAlerts  = false
              - sigV4Auth     = false
              - timescaledb   = false
              - xpack         = false
                # (1 unchanged attribute hidden)
            }
        )
        name               = "prod-prod-cast-cloudwatch"
        # (5 unchanged attributes hidden)

      - json_data {
          - conn_max_lifetime             = 0 -> null
          - default_region                = "eu-central-1" -> null
          - manage_alerts                 = false -> null
          - max_concurrent_shard_requests = 0 -> null
          - max_idle_conns                = 0 -> null
          - max_lines                     = 0 -> null
          - max_open_conns                = 0 -> null
          - postgres_version              = 0 -> null
          - sigv4_auth                    = false -> null
          - timescaledb                   = false -> null
          - tls_auth                      = false -> null
          - tls_auth_with_ca_cert         = false -> null
          - tls_skip_verify               = false -> null
          - tsdb_resolution               = 0 -> null
          - tsdb_version                  = 0 -> null
          - xpack_enabled                 = false -> null
        }
    }

  # module.o11y.grafana_data_source.prometheus will be updated in-place
  ~ resource "grafana_data_source" "prometheus" {
        id                 = "105"
      ~ json_data_encoded  = jsonencode(
          ~ {
              - timescaledb   = false
              - xpack         = false
                # (5 unchanged attributes hidden)
            }
        )
        name               = "prod-prod-cast-amp"
        # (6 unchanged attributes hidden)

      - json_data {
          - conn_max_lifetime             = 0 -> null
          - http_method                   = "GET" -> null
          - manage_alerts                 = false -> null
          - max_concurrent_shard_requests = 0 -> null
          - max_idle_conns                = 0 -> null
          - max_lines                     = 0 -> null
          - max_open_conns                = 0 -> null
          - postgres_version              = 0 -> null
          - sigv4_auth                    = true -> null
          - sigv4_auth_type               = "workspace-iam-role" -> null
          - sigv4_region                  = "eu-central-1" -> null
          - timescaledb                   = false -> null
          - tls_auth                      = false -> null
          - tls_auth_with_ca_cert         = false -> null
          - tls_skip_verify               = false -> null
          - tsdb_resolution               = 0 -> null
          - tsdb_version                  = 0 -> null
          - xpack_enabled                 = false -> null
        }
    }

  # module.vpc.aws_eip.nat[0] will be updated in-place
  ~ resource "aws_eip" "nat" {
        id                   = "eipalloc-0c8437824945a3b49"
      ~ tags                 = {
          ~ "Name" = "staging.eu-central-1.cast-eu-central-1a" -> "prod.eu-central-1.cast-eu-central-1a"
        }
      ~ tags_all             = {
          ~ "Name"      = "staging.eu-central-1.cast-eu-central-1a" -> "prod.eu-central-1.cast-eu-central-1a"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.vpc.aws_eip.nat[1] will be updated in-place
  ~ resource "aws_eip" "nat" {
        id                   = "eipalloc-0e33e56695ece3d7d"
      ~ tags                 = {
          ~ "Name" = "staging.eu-central-1.cast-eu-central-1b" -> "prod.eu-central-1.cast-eu-central-1b"
        }
      ~ tags_all             = {
          ~ "Name"      = "staging.eu-central-1.cast-eu-central-1b" -> "prod.eu-central-1.cast-eu-central-1b"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.vpc.aws_eip.nat[2] will be updated in-place
  ~ resource "aws_eip" "nat" {
        id                   = "eipalloc-0afc9468a4ca89569"
      ~ tags                 = {
          ~ "Name" = "staging.eu-central-1.cast-eu-central-1c" -> "prod.eu-central-1.cast-eu-central-1c"
        }
      ~ tags_all             = {
          ~ "Name"      = "staging.eu-central-1.cast-eu-central-1c" -> "prod.eu-central-1.cast-eu-central-1c"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.vpc.aws_internet_gateway.this[0] will be updated in-place
  ~ resource "aws_internet_gateway" "this" {
        id       = "igw-03acd58816156e9fd"
      ~ tags     = {
          ~ "Name" = "staging.eu-central-1.cast" -> "prod.eu-central-1.cast"
        }
      ~ tags_all = {
          ~ "Name"      = "staging.eu-central-1.cast" -> "prod.eu-central-1.cast"
            # (2 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.vpc.aws_nat_gateway.this[0] will be updated in-place
  ~ resource "aws_nat_gateway" "this" {
        id                   = "nat-018423260d41de2fa"
      ~ tags                 = {
          ~ "Name" = "staging.eu-central-1.cast-eu-central-1a" -> "prod.eu-central-1.cast-eu-central-1a"
        }
      ~ tags_all             = {
          ~ "Name"      = "staging.eu-central-1.cast-eu-central-1a" -> "prod.eu-central-1.cast-eu-central-1a"
            # (2 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.vpc.aws_nat_gateway.this[1] will be updated in-place
  ~ resource "aws_nat_gateway" "this" {
        id                   = "nat-08dc11f958824e231"
      ~ tags                 = {
          ~ "Name" = "staging.eu-central-1.cast-eu-central-1b" -> "prod.eu-central-1.cast-eu-central-1b"
        }
      ~ tags_all             = {
          ~ "Name"      = "staging.eu-central-1.cast-eu-central-1b" -> "prod.eu-central-1.cast-eu-central-1b"
            # (2 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.vpc.aws_nat_gateway.this[2] will be updated in-place
  ~ resource "aws_nat_gateway" "this" {
        id                   = "nat-0ab86b39f7a54a399"
      ~ tags                 = {
          ~ "Name" = "staging.eu-central-1.cast-eu-central-1c" -> "prod.eu-central-1.cast-eu-central-1c"
        }
      ~ tags_all             = {
          ~ "Name"      = "staging.eu-central-1.cast-eu-central-1c" -> "prod.eu-central-1.cast-eu-central-1c"
            # (2 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[0] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0c288f77eacde2fbe"
      ~ tags             = {
          ~ "Name" = "staging.eu-central-1.cast-private-eu-central-1a" -> "prod.eu-central-1.cast-private-eu-central-1a"
        }
      ~ tags_all         = {
          ~ "Name"      = "staging.eu-central-1.cast-private-eu-central-1a" -> "prod.eu-central-1.cast-private-eu-central-1a"
            # (2 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[1] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0c3e9720c05d070ed"
      ~ tags             = {
          ~ "Name" = "staging.eu-central-1.cast-private-eu-central-1b" -> "prod.eu-central-1.cast-private-eu-central-1b"
        }
      ~ tags_all         = {
          ~ "Name"      = "staging.eu-central-1.cast-private-eu-central-1b" -> "prod.eu-central-1.cast-private-eu-central-1b"
            # (2 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[2] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0a64f52c287c6a6e5"
      ~ tags             = {
          ~ "Name" = "staging.eu-central-1.cast-private-eu-central-1c" -> "prod.eu-central-1.cast-private-eu-central-1c"
        }
      ~ tags_all         = {
          ~ "Name"      = "staging.eu-central-1.cast-private-eu-central-1c" -> "prod.eu-central-1.cast-private-eu-central-1c"
            # (2 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.public[0] will be updated in-place
  ~ resource "aws_route_table" "public" {
        id               = "rtb-0c84b3083241531c8"
      ~ tags             = {
          ~ "Name" = "staging.eu-central-1.cast-public" -> "prod.eu-central-1.cast-public"
        }
      ~ tags_all         = {
          ~ "Name"      = "staging.eu-central-1.cast-public" -> "prod.eu-central-1.cast-public"
            # (2 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[0] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-0a3c036497e8234de"
      ~ tags                                           = {
            "Class"      = "private"
          ~ "Name"       = "staging.eu-central-1.cast-private-eu-central-1a" -> "prod.eu-central-1.cast-private-eu-central-1a"
            "Visibility" = "private"
        }
      ~ tags_all                                       = {
          ~ "Name"       = "staging.eu-central-1.cast-private-eu-central-1a" -> "prod.eu-central-1.cast-private-eu-central-1a"
            # (4 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[1] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-036d467c84ca01384"
      ~ tags                                           = {
            "Class"      = "private"
          ~ "Name"       = "staging.eu-central-1.cast-private-eu-central-1b" -> "prod.eu-central-1.cast-private-eu-central-1b"
            "Visibility" = "private"
        }
      ~ tags_all                                       = {
          ~ "Name"       = "staging.eu-central-1.cast-private-eu-central-1b" -> "prod.eu-central-1.cast-private-eu-central-1b"
            # (4 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[2] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-0d4042d16726942b3"
      ~ tags                                           = {
            "Class"      = "private"
          ~ "Name"       = "staging.eu-central-1.cast-private-eu-central-1c" -> "prod.eu-central-1.cast-private-eu-central-1c"
            "Visibility" = "private"
        }
      ~ tags_all                                       = {
          ~ "Name"       = "staging.eu-central-1.cast-private-eu-central-1c" -> "prod.eu-central-1.cast-private-eu-central-1c"
            # (4 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[0] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-07331ced68ed33843"
      ~ tags                                           = {
            "Class"      = "public"
          ~ "Name"       = "staging.eu-central-1.cast-public-eu-central-1a" -> "prod.eu-central-1.cast-public-eu-central-1a"
            "Visibility" = "public"
        }
      ~ tags_all                                       = {
          ~ "Name"       = "staging.eu-central-1.cast-public-eu-central-1a" -> "prod.eu-central-1.cast-public-eu-central-1a"
            # (4 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[1] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-05f569beaaeab5a9c"
      ~ tags                                           = {
            "Class"      = "public"
          ~ "Name"       = "staging.eu-central-1.cast-public-eu-central-1b" -> "prod.eu-central-1.cast-public-eu-central-1b"
            "Visibility" = "public"
        }
      ~ tags_all                                       = {
          ~ "Name"       = "staging.eu-central-1.cast-public-eu-central-1b" -> "prod.eu-central-1.cast-public-eu-central-1b"
            # (4 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[2] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-0875784f65a86c980"
      ~ tags                                           = {
            "Class"      = "public"
          ~ "Name"       = "staging.eu-central-1.cast-public-eu-central-1c" -> "prod.eu-central-1.cast-public-eu-central-1c"
            "Visibility" = "public"
        }
      ~ tags_all                                       = {
          ~ "Name"       = "staging.eu-central-1.cast-public-eu-central-1c" -> "prod.eu-central-1.cast-public-eu-central-1c"
            # (4 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_vpc.this[0] will be updated in-place
  ~ resource "aws_vpc" "this" {
        id                                   = "vpc-0a1fcdb78e9e20c2c"
      ~ tags                                 = {
          ~ "Name" = "staging.eu-central-1.cast" -> "prod.eu-central-1.cast"
        }
      ~ tags_all                             = {
          ~ "Name"      = "staging.eu-central-1.cast" -> "prod.eu-central-1.cast"
            # (2 unchanged elements hidden)
        }
        # (16 unchanged attributes hidden)
    }

Plan: 12 to add, 22 to change, 1 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # module.analytics.aws_kms_alias.analytics_bucket will be created%0A  + resource "aws_kms_alias" "analytics_bucket" {%0A      + arn            = (known after apply)%0A      + id             = (known after apply)%0A      + name           = "alias/analytics/cast/prod"%0A      + name_prefix    = (known after apply)%0A      + target_key_arn = (known after apply)%0A      + target_key_id  = (known after apply)%0A    }%0A%0A  # module.analytics.aws_kms_key.analytics_bucket will be created%0A  + resource "aws_kms_key" "analytics_bucket" {%0A      + arn                                = (known after apply)%0A      + bypass_policy_lockout_safety_check = false%0A      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"%0A      + deletion_window_in_days            = 10%0A      + description                        = "cast.prod - analytics bucket encryption"%0A      + enable_key_rotation                = true%0A      + id                                 = (known after apply)%0A      + is_enabled                         = true%0A      + key_id                             = (known after apply)%0A      + key_usage                          = "ENCRYPT_DECRYPT"%0A      + multi_region                       = (known after apply)%0A      + policy                             = (known after apply)%0A      + tags_all                           = {%0A          + "Name"      = "walletconnect-prod-cast"%0A          + "Namespace" = "walletconnect"%0A          + "Stage"     = "prod"%0A        }%0A    }%0A%0A  # module.analytics.aws_s3_bucket.analytics-data-lake_bucket will be created%0A  + resource "aws_s3_bucket" "analytics-data-lake_bucket" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = "walletconnect.cast.prod.analytics.data-lake"%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = false%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = (known after apply)%0A      + policy                      = (known after apply)%0A      + region                      = (known after apply)%0A      + request_payer               = (known after apply)%0A      + tags_all                    = {%0A          + "Name"      = "walletconnect-prod-cast"%0A          + "Namespace" = "walletconnect"%0A          + "Stage"     = "prod"%0A        }%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A    }%0A%0A  # module.analytics.aws_s3_bucket_acl.analytics-data-lake_acl will be created%0A  + resource "aws_s3_bucket_acl" "analytics-data-lake_acl" {%0A      + acl    = "private"%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A    }%0A%0A  # module.analytics.aws_s3_bucket_public_access_block.analytics-data-lake_bucket will be created%0A  + resource "aws_s3_bucket_public_access_block" "analytics-data-lake_bucket" {%0A      + block_public_acls       = true%0A      + block_public_policy     = true%0A      + bucket                  = (known after apply)%0A      + id                      = (known after apply)%0A      + ignore_public_acls      = true%0A      + restrict_public_buckets = true%0A    }%0A%0A  # module.analytics.aws_s3_bucket_server_side_encryption_configuration.analytics-data-lake_bucket will be created%0A  + resource "aws_s3_bucket_server_side_encryption_configuration" "analytics-data-lake_bucket" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A%0A      + rule {%0A          + bucket_key_enabled = true%0A%0A          + apply_server_side_encryption_by_default {%0A              + kms_master_key_id = (known after apply)%0A              + sse_algorithm     = "aws:kms"%0A            }%0A        }%0A    }%0A%0A  # module.analytics.aws_s3_bucket_versioning.analytics-data-lake_bucket will be created%0A  + resource "aws_s3_bucket_versioning" "analytics-data-lake_bucket" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A%0A      + versioning_configuration {%0A          + mfa_delete = (known after apply)%0A          + status     = "Enabled"%0A        }%0A    }%0A%0A  # module.ecs.aws_ecs_service.app_service will be updated in-place%0A  ~ resource "aws_ecs_service" "app_service" {%0A        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/prod-cast/prod-cast-service"%0A        name                               = "prod-cast-service"%0A        tags                               = {}%0A      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/prod-cast:16" -> (known after apply)%0A        # (15 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # module.ecs.aws_ecs_task_definition.app_task_definition must be replaced%0A-/+ resource "aws_ecs_task_definition" "app_task_definition" {%0A      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/prod-cast:16" -> (known after apply)%0A      ~ container_definitions    = (sensitive value) # forces replacement%0A      ~ id                       = "prod-cast" -> (known after apply)%0A      ~ revision                 = 16 -> (known after apply)%0A      - tags                     = {} -> null%0A        # (9 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.ecs.aws_iam_policy.analytics-data-lake_bucket_access will be created%0A  + resource "aws_iam_policy" "analytics-data-lake_bucket_access" {%0A      + arn         = (known after apply)%0A      + description = "Allows prod-cast to read/write from walletconnect.cast.prod.analytics.data-lake"%0A      + id          = (known after apply)%0A      + name        = "prod-cast_analytics-data-lake_bucket_access"%0A      + path        = "/"%0A      + policy      = (known after apply)%0A      + policy_id   = (known after apply)%0A      + tags_all    = {%0A          + "Name"      = "walletconnect-prod-cast"%0A          + "Namespace" = "walletconnect"%0A          + "Stage"     = "prod"%0A        }%0A    }%0A%0A  # module.ecs.aws_iam_policy.geoip_bucket_access will be created%0A  + resource "aws_iam_policy" "geoip_bucket_access" {%0A      + arn         = (known after apply)%0A      + description = "Allows prod-cast to read from prod.relay.geo.ip.database.private.prod.walletconnect"%0A      + id          = (known after apply)%0A      + name        = "prod-cast_geoip_bucket_access"%0A      + path        = "/"%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = [%0A                          + "s3:ListBucket",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = [%0A                          + "arn:aws:s3:::prod.relay.geo.ip.database.private.prod.walletconnect",%0A                        ]%0A                      + Sid      = "ListObjectsInGeoipBucket"%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "s3:CopyObject",%0A                          + "s3:GetObject",%0A                          + "s3:HeadObject",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = [%0A                          + "arn:aws:s3:::prod.relay.geo.ip.database.private.prod.walletconnect/*",%0A                        ]%0A                      + Sid      = "AllObjectActionsInGeoipBucket"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + policy_id   = (known after apply)%0A      + tags_all    = {%0A          + "Name"      = "walletconnect-prod-cast"%0A          + "Namespace" = "walletconnect"%0A          + "Stage"     = "prod"%0A        }%0A    }%0A%0A  # module.ecs.aws_iam_role_policy_attachment.analytics-data-lake-bucket-policy-attach will be created%0A  + resource "aws_iam_role_policy_attachment" "analytics-data-lake-bucket-policy-attach" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = "prod-cast-ecs-task-execution-role"%0A    }%0A%0A  # module.ecs.aws_iam_role_policy_attachment.geoip-bucket-policy-attach will be created%0A  + resource "aws_iam_role_policy_attachment" "geoip-bucket-policy-attach" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = "prod-cast-ecs-task-execution-role"%0A    }%0A%0A  # module.o11y.grafana_dashboard.at_a_glance will be updated in-place%0A  ~ resource "grafana_dashboard" "at_a_glance" {%0A      ~ config_json  = jsonencode(%0A          ~ {%0A              ~ panels               = [%0A                    # (7 unchanged elements hidden)%0A                    {%0A                        datasource  = {%0A                            type = "prometheus"%0A                            uid  = "x-XVJF14k"%0A                        }%0A                        fieldConfig = {%0A                            defaults  = {%0A                                color      = {%0A                                    mode = "palette-classic"%0A                                }%0A                                custom     = {%0A                                    axisLabel         = ""%0A                                    axisPlacement     = "auto"%0A                                    barAlignment      = 0%0A                                    drawStyle         = "line"%0A                                    fillOpacity       = 0%0A                                    gradientMode      = "none"%0A                                    hideFrom          = {%0A                                        legend  = false%0A                                        tooltip = false%0A                                        viz     = false%0A                                    }%0A                                    lineInterpolation = "linear"%0A                                    lineStyle         = {%0A                                        fill = "solid"%0A                                    }%0A                                    lineWidth         = 1%0A                                    pointSize         = 5%0A                                    scaleDistribution = {%0A                                        type = "linear"%0A                                    }%0A                                    showPoints        = "auto"%0A                                    spanNulls         = false%0A                                    stacking          = {%0A                                        group = "A"%0A                                        mode  = "none"%0A                                    }%0A                                    thresholdsStyle   = {%0A                                        mode = "off"%0A                                    }%0A                                }%0A                                mappings   = []%0A                                thresholds = {%0A                                    mode  = "absolute"%0A                                    steps = [%0A                                        {%0A                                            color = "green"%0A                                            value = null%0A                                        },%0A                                        {%0A                                            color = "red"%0A                                            value = 80%0A                                        },%0A                                    ]%0A                                }%0A                            }%0A                            overrides = []%0A                        }%0A                        gridPos     = {%0A                            h = 8%0A                            w = 12%0A                            x = 12%0A                            y = 18%0A                        }%0A                        options     = {%0A                            legend  = {%0A                                calcs       = []%0A                                displayMode = "list"%0A                                placement   = "bottom"%0A                            }%0A                            tooltip = {%0A                                mode = "single"%0A                                sort = "none"%0A                            }%0A                        }%0A                        targets     = [%0A                            {%0A                                datasource   = {%0A                                    type = "prometheus"%0A                                    uid  = "x-XVJF14k"%0A                                }%0A                                exemplar     = true%0A                                expr         = "increase(dispatched_notifications{type=\"sent\"}[5m])"%0A                                interval     = ""%0A                                legendFormat = "Sent push"%0A                                refId        = "A"%0A                            },%0A                        ]%0A                        title       = "Dispatched Notifications"%0A                        type        = "timeseries"%0A                    },%0A                  ~ {%0A                      ~ alert       = {%0A                          ~ name                = "Cast failing on send (communicating with relay)" -> "prod Cast failing on send (communicating with relay)"%0A                            # (9 unchanged attributes hidden)%0A                        }%0A                        # (8 unchanged attributes hidden)%0A                    },%0A                    {%0A                        datasource  = {%0A                            type = "prometheus"%0A                            uid  = "x-XVJF14k"%0A                        }%0A                        fieldConfig = {%0A                            defaults  = {%0A                                color      = {%0A                                    fixedColor = "light-yellow"%0A                                    mode       = "fixed"%0A                                }%0A                                custom     = {%0A                                    axisLabel         = ""%0A                                    axisPlacement     = "auto"%0A                                    barAlignment      = 0%0A                                    drawStyle         = "line"%0A                                    fillOpacity       = 0%0A                                    gradientMode      = "none"%0A                                    hideFrom          = {%0A                                        legend  = false%0A                                        tooltip = false%0A                                        viz     = false%0A                                    }%0A                                    lineInterpolation = "linear"%0A                                    lineStyle         = {%0A                                        fill = "solid"%0A                                    }%0A                                    lineWidth         = 1%0A                                    pointSize         = 5%0A                                    scaleDistribution = {%0A                                        type = "linear"%0A                                    }%0A                                    showPoints        = "auto"%0A                                    spanNulls         = false%0A                                    stacking          = {%0A                                        group = "A"%0A                                        mode  = "none"%0A                                    }%0A                                    thresholdsStyle   = {%0A                                        mode = "off"%0A                                    }%0A                                }%0A                                mappings   = []%0A                                thresholds = {%0A                                    mode  = "absolute"%0A                                    steps = [%0A                                        {%0A                                            color = "green"%0A                                            value = null%0A                                        },%0A                                        {%0A                                            color = "red"%0A                                            value = 80%0A                                        },%0A                                    ]%0A                                }%0A                            }%0A                            overrides = []%0A                        }%0A                        gridPos     = {%0A                            h = 8%0A                            w = 12%0A                            x = 12%0A                            y = 26%0A                        }%0A                        options     = {%0A                            legend  = {%0A                                calcs       = []%0A                                displayMode = "list"%0A                                placement   = "bottom"%0A                            }%0A                            tooltip = {%0A                                mode = "single"%0A                                sort = "none"%0A                            }%0A                        }%0A                        targets     = [%0A                            {%0A                                datasource   = {%0A                                    type = "prometheus"%0A                                    uid  = "x-XVJF14k"%0A                                }%0A                                exemplar     = true%0A                                expr         = "increase(dispatched_notifications{type=\"not_found\"}[5m])"%0A                                interval     = ""%0A                                legendFormat = "Not found"%0A                                refId        = "A"%0A                            },%0A                        ]%0A                        title       = "Not found accounts"%0A                        type        = "timeseries"%0A                    },%0A                    {%0A                        collapsed = false%0A                        gridPos   = {%0A                            h = 1%0A                            w = 24%0A                            x = 0%0A                            y = 34%0A                        }%0A                        panels    = []%0A                        title     = "AWS Load Balancer"%0A                        type      = "row"%0A                    },%0A                  ~ {%0A                      ~ alert       = {%0A                          ~ name                = "Cast Server 4XX alert" -> "prod Cast Server 4XX alert"%0A                            # (9 unchanged attributes hidden)%0A                        }%0A                        # (8 unchanged attributes hidden)%0A                    },%0A                  ~ {%0A                      ~ alert       = {%0A                          ~ name                = "Cast Server 5XX alert" -> "prod Cast Server 5XX alert"%0A                            # (9 unchanged attributes hidden)%0A                        }%0A                        # (8 unchanged attributes hidden)%0A                    },%0A                    {%0A                        datasource  = {%0A                            type = "cloudwatch"%0A                            uid  = "BvXV1F1Vz"%0A                        }%0A                        fieldConfig = {%0A                            defaults  = {%0A                                color      = {%0A                                    mode = "palette-classic"%0A                                }%0A                                custom     = {%0A                                    axisLabel         = ""%0A                                    axisPlacement     = "auto"%0A                                    barAlignment      = 0%0A                                    drawStyle         = "line"%0A                                    fillOpacity       = 0%0A                                    gradientMode      = "none"%0A                                    hideFrom          = {%0A                                        legend  = false%0A                                        tooltip = false%0A                                        viz     = false%0A                                    }%0A                                    lineInterpolation = "linear"%0A                                    lineWidth         = 1%0A                                    pointSize         = 5%0A                                    scaleDistribution = {%0A                                        type = "linear"%0A                                    }%0A                                    showPoints        = "auto"%0A                                    spanNulls         = false%0A                                    stacking          = {%0A                                        group = "A"%0A                                        mode  = "none"%0A                                    }%0A                                    thresholdsStyle   = {%0A                                        mode = "off"%0A                                    }%0A                                }%0A                                mappings   = []%0A                                thresholds = {%0A                                    mode  = "absolute"%0A                                    steps = [%0A                                        {%0A                                            color = "green"%0A                                            value = null%0A                                        },%0A                                        {%0A                                            color = "red"%0A                                            value = 80%0A                                        },%0A                                    ]%0A                                }%0A                            }%0A                            overrides = []%0A                        }%0A                        gridPos     = {%0A                            h = 10%0A                            w = 7%0A                            x = 14%0A                            y = 35%0A                        }%0A                        options     = {%0A                            legend  = {%0A                                calcs       = []%0A                                displayMode = "list"%0A                                placement   = "bottom"%0A                            }%0A                            tooltip = {%0A                                mode = "single"%0A                                sort = "none"%0A                            }%0A                        }%0A                        targets     = [%0A                            {%0A                                alias            = ""%0A                                datasource       = {%0A                                    type = "cloudwatch"%0A                                    uid  = "BvXV1F1Vz"%0A                                }%0A                                dimensions       = {%0A                                    LoadBalancer = "app/prod-cast-load-balancer/1d8bba8db8109fec"%0A                                }%0A                                expression       = ""%0A                                id               = ""%0A                                matchExact       = true%0A                                metricEditorMode = 0%0A                                metricName       = "RequestCount"%0A                                metricQueryType  = 0%0A                                namespace        = "AWS/ApplicationELB"%0A                                period           = ""%0A                                queryMode        = "Metrics"%0A                                refId            = "A"%0A                                region           = "default"%0A                                sqlExpression    = ""%0A                                statistic        = "Sum"%0A                            },%0A                        ]%0A                        title       = "Request"%0A                        type        = "timeseries"%0A                    },%0A                ]%0A                tags                 = []%0A                # (16 unchanged attributes hidden)%0A            }%0A        )%0A        id           = "0:prod-cast"%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # module.o11y.grafana_data_source.cloudwatch will be updated in-place%0A  ~ resource "grafana_data_source" "cloudwatch" {%0A        id                 = "104"%0A      ~ json_data_encoded  = jsonencode(%0A          ~ {%0A              - authType      = "ec2_iam_role"%0A              - manageAlerts  = false%0A              - sigV4Auth     = false%0A              - timescaledb   = false%0A              - xpack         = false%0A                # (1 unchanged attribute hidden)%0A            }%0A        )%0A        name               = "prod-prod-cast-cloudwatch"%0A        # (5 unchanged attributes hidden)%0A%0A      - json_data {%0A          - conn_max_lifetime             = 0 -> null%0A          - default_region                = "eu-central-1" -> null%0A          - manage_alerts                 = false -> null%0A          - max_concurrent_shard_requests = 0 -> null%0A          - max_idle_conns                = 0 -> null%0A          - max_lines                     = 0 -> null%0A          - max_open_conns                = 0 -> null%0A          - postgres_version              = 0 -> null%0A          - sigv4_auth                    = false -> null%0A          - timescaledb                   = false -> null%0A          - tls_auth                      = false -> null%0A          - tls_auth_with_ca_cert         = false -> null%0A          - tls_skip_verify               = false -> null%0A          - tsdb_resolution               = 0 -> null%0A          - tsdb_version                  = 0 -> null%0A          - xpack_enabled                 = false -> null%0A        }%0A    }%0A%0A  # module.o11y.grafana_data_source.prometheus will be updated in-place%0A  ~ resource "grafana_data_source" "prometheus" {%0A        id                 = "105"%0A      ~ json_data_encoded  = jsonencode(%0A          ~ {%0A              - timescaledb   = false%0A              - xpack         = false%0A                # 
...

```

</details>

*Action: `pull_request`*